export const recipesMock = {
  success: true,
  data: [
    {
      _id: '1',
      name: 'Омлет с томатами',
      ingredients: {
        Яйца: '3 шт',
        Молоко: '100 мл',
        Помидоры: '2 шт',
        Масло: '20 г',
        Специи: 'По вкусу'
      },
      cooking:
        'Взбить яйца с молоком до воздушной пены. Разогреть масло на скоророде до кипения, средний огонь. Влить туда яичную смесь, постоянно помешивая. Когда смесь побелеет, добавить туда томаты, 2 минуты непрерывно мешать, затем накрыть крышкой и убавить огонь на минимума на 3 минуты. Подавать к столу со свежим хлебом, можно украсить зеленью',
      image:
        'https://cdn.pixabay.com/photo/2018/06/23/07/05/egg-3492196_1280.jpg'
    },
    {
      _id: '6',
      name: 'Тыквенный суп-пюре',
      ingredients: {
        Тыква: '300 г',
        Картофель: '2 шт',
        Лук: '1 шт',
        Морковь: '1 шт',
        Сливки: '100-150 мл',
        Специи: 'По вкусу'
      },
      cooking:
        'Очищенные и нарезанные на равные куски овощи отварить на среднем огне до готовности (примерно 40 минут, готовность проверять по картофелю, должен легко протыкаться ножом. Слить бульон в отдельную тару. Взбить с помощью блендера, добавив немного полученного бульона. Влить подогретые сливки, взбить до нужной косистенции, при необходимости сильнее разбавив полученным овощным бульоном',
      image:
        'https://cdn.pixabay.com/photo/2016/09/21/20/18/pumpkin-soup-1685574_1280.jpg'
    },
    {
      _id: '2',
      name: 'Домашние блинчики',
      ingredients: {
        Яйца: '3 шт',
        Молоко: '300 мл',
        Мука: '200 г',
        Масло: '20 г',
        Сахар: '50 г',
        Соль: '5 г'
      },
      cooking:
        'Взбить яйца с молоком и маслом, добавить соль. Добавить половину муки, тщательно размешать. Добавить четверть (примерно) объёма молока, размешать. Добавить оставшуюся муку, размешать. Влить оставшееся молоко, размешать. Разогреть сковороду. Выпекать без масла, наливая тесто тонким слоем на сковороду, выпекать с двух сторон',
      image:
        'https://cdn.pixabay.com/photo/2020/03/01/20/39/carnival-4894072_1280.jpg'
    },
    {
      _id: '3',
      name: 'Омлет с грибами',
      ingredients: {
        Яйца: '3 шт',
        Молоко: '100 мл',
        Шампиньоны: '300 г',
        Масло: '20 г',
        Специи: 'По вкусу'
      },
      cooking:
        'Взбить яйца с молоком до воздушной пены. Разогреть масло на скоророде до кипения, средний огонь. Нарезанные шампионы высыпать на сковродку и обжарить до выделения сока. Влить туда яичную смесь, постоянно помешивая. Когда смесь побелеет, 2 минуты непрерывно мешать, затем накрыть крышкой и убавить огонь на минимума на 3 минуты. Подавать к столу со свежим хлебом, можно украсить зеленью',
      image:
        'https://cdn.pixabay.com/photo/2017/10/02/12/34/omelette-2808678_1280.jpg'
    },
    {
      _id: '4',
      name: 'Яблочный штрудель (ленивый)',
      ingredients: {
        Яблоки: '2 шт',
        Сахар: '3 ст. ложки',
        Лаваш: '1 шт (максимально тонкий)',
        Карамель: '40 мл',
        'Сахарная пудра': 'По вкусу',
        'Масло сливочное': '20 г'
      },
      cooking:
        'Тонкими ломтиками нарезать яблоко, протушить их на сковороде с сахаром и парой ложек воды. Раскатать лаваш, максимально тонко полосой смазать его маслом, разложить треть яблок, полить четвертью карамели. Положить сверху ещё слой лаваша, повторить всё, чтобы получилось 3 одинаковых слоя. Скатать в плотный рулет, смазать сверу маслом, полить оставшейся карамелью, поставить в духовку на 25 минут 180 градусов. После того, как остынет - подавать украшенным сахарной пудрой',
      image:
        'https://cdn.pixabay.com/photo/2018/09/24/17/01/strudel-3700357_1280.jpg'
    },
    {
      _id: '5',
      name: 'Солёная карамель',
      ingredients: {
        Сахар: '100 г',
        'Сливки 20%': '100 мл',
        'Сливочное масло': '75 г',
        Вода: '2 ст. ложки',
        Соль: 'По вкусу'
      },
      cooking:
        'Сахар насыпаем в сотейник, вливаем пару столовых ложек воды. На среднем огне варим до янтарного цвета. Сдвигаем сотейник с нагрева и небольшими порциями вливаем частями хорошо подогретые сливки, постоянно помешивая венчиком. Возвращаем на огонь и варим еще пару минут. Затем снова снимаем и добавляем нарезанное кубиками масло. Перемешиваем до его растворения. Добавляем соль до нужного вкуса, перемешиваем и перекладываем в миску. Остывшую карамель перекладываем в банку с крышкой и храним в холодильнике.',
      image:
        'https://cdn.pixabay.com/photo/2018/07/30/17/59/caramel-3573171_1280.jpg'
    }
  ]
};
